shopstream-api/app/controllers/api/v1/orders_controller.rb

      def index
        render json: Order.includes(:order_items).all
---
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" IN ($1, $2)  [["order_id", 1], ["order_id", 2]]
SELECT "orders".* FROM "orders"

      def create
        order = Order.new(status: "pending")

        ActiveRecord::Base.transaction do
          order.save!
          (params[:order_items] || []).each do |item_params|
            product = Product.find(item_params[:product_id])
            order.order_items.create!(
              product: product,
              quantity: item_params[:quantity],
              unit_price_cents: product.price_cents
            )
---
INSERT INTO "orders" ("status", "total_cents", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["status", "pending"], ["total_cents", 0], ["created_at", "2026-03-30 17:54:42.232815"], ["updated_at", "2026-03-30 17:54:42.232815"]]
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = $1  [["order_id", 3]]
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "order_items" ("order_id", "product_id", "quantity", "unit_price_cents", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["order_id", 3], ["product_id", 1], ["quantity", 2], ["unit_price_cents", 7999], ["created_at", "2026-03-30 17:54:42.241945"], ["updated_at", "2026-03-30 17:54:42.241945"]]

      def order
        @order ||= Order.includes(:order_items).find(params[:id])
---
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = $1  [["order_id", 1]]
SELECT "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]