shopstream-api/app/controllers/api/v1/products_controller.rb

      def index
        render json: Product.all
---
SELECT "products".* FROM "products"

      def create
        product = Product.new(product_params)
        if product.save
---
INSERT INTO "products" ("name", "price_cents", "description", "stock_count", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Widget"], ["price_cents", 999], ["description", nil], ["stock_count", 10], ["created_at", "2026-03-30 17:47:49.947356"], ["updated_at", "2026-03-30 17:47:49.947356"]]

      def update
        if product.update(product_params)
---
UPDATE "products" SET "stock_count" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["stock_count", 99], ["updated_at", "2026-03-30 17:47:49.966762"], ["id", 9]]